["# RAG-Optimized Portfolio Content for Madhur Chouhan", "## Personal Introduction and Overview\n**Context: About Madhur Chouhan - Basic Introduction**\nHi, I'm Madhur Chouhan. I am an ML Engineer, AI Engineer, and Data Scientist. I specialize in building intelligent systems and have expertise in various AI and data science domains. I showcase my journey and projects in AI and Data Science, reflecting growth and achievements throughout my studies and practical experience.\n\n---", "## Professional Identity and Core Skills\n**Context: Madhur's Professional Background and Identity**\nI am a Data Scientist with a B.Tech in Artificial Intelligence and Data Science. My core technical skills include Python, Large Language Models (LLMs), Prompt Engineering, Fine-tuning, Agentic AI, Natural Language Processing (NLP), Exploratory Data Analysis, Statistics, and Cloud Computing. I have strong experience in building ML systems for predictive analytics, automation, and real-world impact.\n\n---", "## AI Agents Expertise\n**Context: Madhur's AI Agents Specialization**\nI specialize in AI Agents - intelligent autonomous systems that reason, plan, and act toward long-term goals using advanced language models. I have hands-on experience building agentic AI systems and working with frameworks like CrewAI, PydanticAI, Agno, and Langgraph for creating sophisticated AI agents.\n\n---", "## Machine Learning Expertise\n**Context: Madhur's Machine Learning Skills and Experience**\nI have extensive experience in Machine Learning, focusing on building ML systems for predictive analytics, automation, and real-world impact. My ML toolkit includes Scikit-learn, TensorFlow, and various other frameworks. I work on projects involving data analysis, model development, and deployment of ML solutions.\n\n---", "## Deep Learning Specialization\n**Context: Madhur's Deep Learning Knowledge and Projects**\nI specialize in Deep Learning, designing and fine-tuning models from CNNs to large language models for computer vision, NLP, and representation learning. I work with TensorFlow, OpenCV, and other deep learning frameworks to create sophisticated neural network solutions.\n\n---", "## Backend Development Skills\n**Context: Madhur's Backend Development Capabilities**\nI have strong backend development skills, creating scalable, cloud-native backend services and APIs with modern server-side technologies. My backend technology stack includes FastAPI, Django, Flask, and experience with databases like MySQL, MongoDB, SQLite3, ChromaDB, and FAISS. I also work with cloud platforms like AWS and GCP.\n\n---", "## Educational Background - B.Tech Degree\n**Context: Madhur's University Education and Academic Performance**\nI have completed my B.Tech in Artificial Intelligence and Data Science from Chameli Devi Group Indore (2021-2025) with a CGPA of 7.5. This specialized degree has given me deep knowledge in AI, machine learning, data science, and related technologies.\n\n---", "## Educational Background - School Education\n**Context: Madhur's School Academic History**\nI completed my Higher Secondary education at Lokmanya Tilak School, Ujjain (2019-2021) with 89.4% marks. My High School education was completed at King David School, Bhopal (2018-2019) with 89.8% marks, showing consistent academic performance throughout my educational journey.\n\n---", "## Current Professional Role - Data Scientist Trainee\n**Context: Madhur's Current Job at Xalt Analytics**\nI am currently working as a Data Scientist - Trainee at Xalt Analytics Pvt. Ltd in Indore, India (April 2025 - Present). In this role, I developed UX Weaver, an AI-powered diagram generator using Gemini and CrewAI. I also automated the entire video ad creation pipeline with AI and AWS hosting, demonstrating my ability to create end-to-end AI solutions.\n\n---", "## Previous Professional Experience - Internship\n**Context: Madhur's Internship Experience at Xalt Analytics**\nI worked as a Data Scientist - Intern at Xalt Analytics Pvt. Ltd in Indore, India (Jan 2025 - Mar 2025). During this internship, I created QueryVerse, which enables natural language interaction with MySQL databases. I also contributed to real-time trading analytics with algorithmic data processing, gaining valuable industry experience.\n\n---", "## Project: Intelligent Email Generation System\n**Context: Madhur's Email AI Project Details**\nI developed an Intelligent Email Generation & Response System using PydanticAI, FastAPI, HTML, and CSS. This AI-powered email system for portfolio websites features dual agents that generate and refine emails with recursive feedback. The system includes email intent classification and auto-reply features, showcasing my ability to build practical AI applications.\n\n---", "## Project: AI Meeting Scheduler Bot\n**Context: Madhur's Meeting Scheduler AI Project**\nI created an AI Meeting Scheduler Bot using CrewAI, GoogleAPI, and Streamlit. This system extracts meeting information from natural language input, detects scheduling conflicts, and automatically schedules meetings with Google Meet links. This project demonstrates my skills in integrating AI with external APIs and creating user-friendly interfaces.\n\n---", "## Project: QueryVerse Database System\n**Context: Madhur's QueryVerse Natural Language Database Project**\nI built QueryVerse using CrewAI, FastAPI, Streamlit, and Railway hosting. This system converts natural language queries into executable MySQL commands with an integrated UI for query execution and result visualization. It supports user database connections via Railway hosting, showing my full-stack development and deployment capabilities.\n\n---", "## Programming Languages and Core Technologies\n**Context: Madhur's Programming Languages and Technical Foundation**\nMy primary programming languages are Python3 and C/C++. I specialize in AI technologies including Artificial Intelligence, Agentic AI, Machine Learning, Deep Learning, Natural Language Processing, Computer Vision, and Generative AI. I have extensive experience with Python for AI/ML development and C/C++ for system-level programming.\n\n---", "## AI and ML Libraries and Frameworks\n**Context: Madhur's AI/ML Technology Stack**\nI work extensively with AI and ML libraries including CrewAI, PydanticAI, Agno, Langgraph, Scikit-learn, TensorFlow, OpenCV, NLTK, Whisper, Moviepy, Autogen, Langchain, ollama, groq, cohere, LlamaIndex, and DeepFace. This comprehensive toolkit allows me to build sophisticated AI solutions across various domains.\n\n---", "## Web Development and API Technologies\n**Context: Madhur's Web Development and API Skills**\nI have strong web development skills using FastAPI, Django, Flask for backend development, and HTML5, CSS3 for frontend. I also work with Streamlit for creating interactive data science applications. My experience includes building scalable APIs and web applications that integrate with AI/ML systems.\n\n---", "## Database Technologies and Data Storage\n**Context: Madhur's Database and Data Management Skills**\nI work with various database technologies including MySQL, MongoDB, SQLite3, ChromaDB, and FAISS. This diverse database experience allows me to choose the right data storage solution for different projects, from traditional relational databases to vector databases for AI applications.\n\n---", "## Cloud Platforms and Development Tools\n**Context: Madhur's Cloud Computing and Development Environment**\nI have experience with cloud platforms including AWS and GCP for deploying and scaling applications. My development toolkit includes Git, GitHub for version control, Tableau for data visualization, and Supabase for backend services. I'm comfortable with cloud-native development and deployment practices.\n\n---", "## Academic Achievements and Recognition\n**Context: Madhur's Academic Awards and Competition Success**\nI won the Python Quiz Competition in 2023 and achieved Rank #1 in Programming Assessment in 2024. These achievements demonstrate my strong programming skills and competitive coding abilities, reflecting my technical competence and dedication to continuous learning.\n\n---", "## Leadership Experience - GDSC Core Team\n**Context: Madhur's Leadership Role in Google Developer Student Clubs**\nI was a GDSC CDGI Core Team Member from 2022-2024, taking on roles in PR & Outreach and Web Development. As a core team member for two consecutive years, I gained valuable leadership experience and contributed to organizing technical events and workshops for fellow students.\n\n---", "## Event Coordination and Outreach Experience\n**Context: Madhur's Event Management and Coordination Skills**\nI coordinated college fest promotions across multiple cities including Pune, Shirdi, Kopargaon, and Bhusawal. This experience developed my project management, communication, and organizational skills while working with diverse teams across different locations.\n\n---", "## Volunteering and Community Service\n**Context: Madhur's Volunteer Work and Community Involvement**\nI have volunteered for FMHR (2022-23) and Malwa Marathon (2023), showing my commitment to community service. I'm also involved with National Service Scheme (NSS), demonstrating my dedication to social causes and community development.\n\n---", "## Personal Interests and Memberships\n**Context: Madhur's Personal Interests and Professional Affiliations**\nMy personal interest includes Astronomy, reflecting my curiosity about science and the universe. I'm an active member of Google Developer Student Clubs (GDSC), Coding & Technical Cell (CTDC), and National Service Scheme (NSS), showing my engagement with both technical and social communities.\n\n---", "## Location and Contact Information\n**Context: Madhur's Location, GitHub, Leetcode, Resume, Social Profiles and How to Contact Him**\nI am based in Indore, India. You can reach me at phone number +91 9111025593 or email madhur.ai.atwork@gmail.com. My professional profile is available on LinkedIn at linkedin.com/in/madhurchouhan and my portfolio website is at madhurchouhan01.github.io/Portfolio and instagram account link https://www.instagram.com/madhur_chouhan_ leetcode profile link for coding https://leetcode.com/madhurchouhan02/ github profile link https://github.com/madhurchouhan01 resume link https://docs.google.com/document/d/1uwJ8qmh0RsUOXRYN_L5Db0e_BqLoGfHFs-op07xKnGs/edit?tab=t.0\n\n---", "## Personality and Soft Skills\n**Context: Madhur's Personal Qualities and Communication Style**\nI have strong interpersonal and communication skills, with a self-motivated and proactive attitude. I work well in teams and have leadership experience through my roles in GDSC and various event coordination activities. I'm passionate about technology and always eager to learn and take on new challenges in AI and data science."]